{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertWithTabular"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "initializer_range": 0.02,
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tabular_config": {
    "cat_feat_dim": 64,
    "combine_feat_method": "gating_on_cat_and_num_feats_then_sum",
    "gating_beta": 0.2,
    "hidden_dropout_prob": 0.2,
    "mlp_act": "relu",
    "mlp_division": 4,
    "mlp_dropout": 0.1,
    "num_labels": 2,
    "numerical_bn": true,
    "numerical_feat_dim": 2,
    "text_feat_dim": 768,
    "use_simple_classifier": true
  },
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "vocab_size": 30522
}
